{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hello!",
        "Hi there!",
        "Greetings!",
        "Hey!",
        "Good to see you!",
        "Nice to meet you!",
        "Howdy!",
        "Hey, what's up?",
        "Welcome!",
        "Hi, how can I assist you?",
        "Hey there, how can I help?",
        "Hello! How may I be of service?",
        "Hi! How can I support you today?",
        "Hey! How can I make your day better?",
        "Greetings and salutations!",
        "Hello, my friend!",
        "Hi! I hope you're doing well.",
        "Hey there! Ready to chat?",
        "Hello! What brings you here today?",
        "Hi! Is there anything specific you need?",
        "Hey! How can I assist you today?",
        "Hello! How are you doing?",
        "Hi! What can I do for you right now?",
        "Hey there! How can I make your life easier?",
        "Hello! How may I make your day brighter?",
        "Hi! What can I help you with today?"
      ]
    },
    {
      "tag": "bye",
      "patterns": [
        "Goodbye!",
        "Farewell!",
        "Take care!",
        "Goodbye! Have a great day!",
        "Bye for now!",
        "Until next time!",
        "Take care and goodbye!",
        "Goodbye! It was nice talking to you.",
        "Farewell! Come back anytime.",
        "Bye! Have a wonderful day!",
        "Take care! See you soon.",
        "Goodbye! Stay safe.",
        "Farewell! Wishing you all the best.",
        "Bye for now! Remember, I'm here if you need assistance.",
        "Take care and have a fantastic day!",
        "Goodbye! Don't hesitate to reach out if you need help in the future.",
        "Farewell! Thank you for chatting with me.",
        "Bye! It was a pleasure assisting you.",
        "Take care! Feel free to return if you have more questions.",
        "Goodbye! Stay well and stay connected.",
        "Farewell! I hope our conversation was helpful.",
        "Bye! Have a great time ahead.",
        "Take care! Remember, I'm just a message away.",
        "Goodbye! May your day be filled with joy.",
        "Farewell! I'm here if you ever need assistance again.",
        "Bye! Stay positive and take care of yourself."
      ]
    },
    {
      "tag": "article_summary",
      "patterns": [
        "Can you summarize this article for me?",
        "What's the summary of this article?",
        "Could you give me a brief overview of the article?",
        "I'd like a summary of the article, please.",
        "Can you provide a synopsis of the article?",
        "Tell me the main points of the article.",
        "Summarize the article in a few sentences.",
        "What are the key takeaways from the article?",
        "Give me a quick summary of the article.",
        "What's the gist of the article?",
        "I'm looking for a summary of this article.",
        "Could you condense the article into a summary?",
        "Provide me with an abstract of the article.",
        "Can you give me a short description of the article?",
        "What's the main idea behind the article?",
        "In a few sentences, explain what the article is about.",
        "I'd like to get a summarized version of the article.",
        "Tell me the highlights of the article.",
        "Can you break down the article into a summary?",
        "What's the essence of the article?",
        "Could you give me a quick rundown of the article?",
        "Provide me with a nutshell summary of the article.",
        "I want to understand the article in a concise way.",
        "Sum up the article in just a few words.",
        "What's the central message of the article?",
        "Give me a brief recap of the article."
      ]
    },
    {
      "tag": "find_articles",
      "patterns": [
        "Find articles on that subject.",
        "Show me articles about a specific topic.",
        "Can you recommend articles related to a particular subject?",
        "I'm interested in reading about a certain topic.",
        "Get me articles on a specific subject.",
        "What articles are there about this subject?",
        "Retrieve articles on an interesting topic.",
        "Are there any recent articles on this matter?",
        "I need information on a specific area.",
        "Tell me about articles discussing a certain theme.",
        "Looking for articles related to a particular matter.",
        "Find recent articles about a specific subject.",
        "I want to read articles on a chosen topic.",
        "Show me the latest articles about a particular subject.",
        "Are there any news articles on this topic?",
        "Search for articles about a specific topic.",
        "Find some good articles about that subject.",
        "I'd like to know more about a particular subject.",
        "Can you find articles that mention a specific area?",
        "Show me popular articles about a particular topic.",
        "Find articles on a subject of interest.",
        "Help me discover articles related to my query.",
        "Suggest articles on a particular theme.",
        "Explore articles about a specific subject.",
        "Show me relevant articles on that topic.",
        "Get me articles discussing a chosen topic.",
        "Recommend articles based on my interest.",
        "Display articles related to my search.",
        "I'm curious about articles on a certain topic.",
        "Provide me with articles on that matter.",
        "Find me articles related to a chosen subject.",
        "Suggest articles based on my preferences.",
        "Retrieve articles covering a specific theme.",
        "Point me to articles about this particular topic.",
        "Find the latest articles about a specific subject.",
        "Suggest informative articles on that subject.",
        "I'd like to explore articles about a certain topic.",
        "Show me articles that discuss a chosen subject.",
        "Recommend articles based on my recent searches.",
        "Discover articles on a particular area of interest.",
        "Find articles that match my current query.",
        "Show me articles related to a specific field.",
        "Get me articles discussing a particular subject.",
        "Provide me with relevant articles on that topic.",
        "Suggest articles based on my previous reading.",
        "Explore articles covering a particular subject.",
        "Point me to articles that talk about a specific area.",
        "Show me popular articles about a chosen topic.",
        "Find articles that align with my interests.",
        "Recommend articles based on my browsing history.",
        "Retrieve articles about a subject I'm curious about.",
        "I'd like to discover articles on a chosen topic.",
        "Show me articles that provide insights into a specific topic.",
        "Suggest articles related to a particular domain.",
        "Find me articles on that particular subject.",
        "Provide me with articles that match my criteria.",
        "Suggest articles based on my reading habits.",
        "Display articles discussing a specific theme.",
        "I'm interested in articles on a certain topic.",
        "Show me articles about a subject of my choice.",
        "Find articles that cover a specific subject.",
        "Recommend articles based on my search history.",
        "Retrieve articles that discuss a chosen area.",
        "Point me to articles about a specific topic.",
        "Show me relevant articles about that subject.",
        "Get me articles that align with my preferences.",
        "Suggest articles related to my area of interest.",
        "Discover articles on a particular topic.",
        "Find articles that provide insights on a specific subject.",
        "Suggest articles that are relevant to my query.",
        "Show me popular articles about this particular topic.",
        "Recommend articles based on my recent interests.",
        "Retrieve articles covering a chosen subject.",
        "I'd like to explore articles on a specific theme.",
        "Provide me with articles about a particular field.",
        "Suggest articles that match my current interests.",
        "Find articles discussing a chosen domain.",
        "Show me articles that relate to a specific topic.",
        "Get me articles related to my current query.",
        "Recommend articles based on my recent searches.",
        "Discover articles about a chosen area of interest.",
        "Find articles that match my current topic.",
        "Suggest articles based on my browsing history.",
        "Retrieve articles on a subject I'm curious about.",
        "I'd like to discover articles about a specific subject.",
        "Show me articles that provide insights into a chosen topic.",
        "Suggest articles related to a particular niche.",
        "Find me articles on a specific subject.",
        "Provide me with articles that match my preferences.",
        "Suggest articles based on my reading choices.",
        "Display articles discussing a specific subject.",
        "I'm interested in articles on a chosen topic.",
        "Show me articles about a subject I want to explore.",
        "Find articles that cover a specific theme.",
        "Recommend articles based on my search patterns.",
        "Retrieve articles that discuss a chosen topic.",
        "Point me to articles about a particular field.",
        "Show me relevant articles on that particular subject.",
        "Get me articles that align with my interests.",
        "Suggest articles related to my preferred domain.",
        "Discover articles on a particular area of interest.",
        "Find articles that provide insights on that topic.",
        "Suggest articles that are relevant to my search.",
        "Show me popular articles about a specific theme.",
        "Recommend articles based on my recent reading.",
        "Retrieve articles covering a specific domain.",
        "I'd like to explore articles about a chosen topic.",
        "Provide me with articles on a particular subject.",
        "Suggest articles that match my current interests.",
        "Find articles discussing a specific niche.",
        "Show me articles that relate to a chosen topic.",
        "Get me articles related to my chosen subject.",
        "Recommend articles based on my recent queries.",
        "Discover articles about a particular theme.",
        "Find articles that match my current domain."
      ]
    },
    {
      "tag": "introduce_self",
      "patterns": [
        "Who are you?",
        "Tell me about yourself.",
        "Introduce yourself.",
        "Can you give me a brief introduction?",
        "How would you describe yourself?",
        "What's your background?",
        "Share a bit about who you are.",
        "What can you tell me about yourself?",
        "Who are you?",
        "What should I know about you?",
        "Could you introduce yourself briefly?",
        "What's your story?",
        "What are your personal details?",
        "Can you provide some information about yourself?",
        "Tell me a little bit about your background.",
        "What's your name and what do you do?",
        "Give me an introduction, please.",
        "How do you define yourself?",
        "What should I know about you as a person?",
        "Can you describe yourself in a few sentences?",
        "What are your interests and passions?",
        "Share some details about your life and experiences.",
        "Can you talk about your skills and expertise?",
        "What led you to where you are today?",
        "What are some notable things about you?",
        "Describe yourself and your journey."
      ]
    },
    {
      "tag": "help",
      "patterns": [
        "Help",
        "What can you do?",
        "What are your abilities?",
        "Tell me about your features.",
        "What functionalities do you have?",
        "How can you assist me?",
        "What services do you provide?",
        "Explain what you're capable of.",
        "What tasks can you perform?",
        "What skills do you possess?",
        "How do you help users?",
        "What are your capabilities?",
        "Give me an overview of your abilities.",
        "What kind of support do you offer?",
        "Can you perform specific tasks?",
        "Enlighten me about your functions.",
        "How do you assist people?",
        "What are your special features?",
        "What services are you programmed to deliver?",
        "Describe your range of capabilities.",
        "Can you explain what you're designed to do?",
        "What are your strengths?",
        "In what ways can you be helpful?",
        "Provide some examples of your tasks.",
        "What expertise do you have?",
        "How can you make my life easier?"
      ]
    },
    {
      "tag": "sell_stock",
      "patterns": [
        "Is it a good time to sell my stock?",
        "What are the signs that indicate selling a stock?",
        "When should I consider selling my stock?",
        "Should I sell my shares in this company?",
        "What factors should I consider before selling a stock?",
        "Is selling my stock now a wise decision?",
        "How do I know if it's the right moment to sell my stock?",
        "What are the indicators to sell a stock?",
        "When is the right time to sell stocks?",
        "Should I consider selling my stock holdings?",
        "What are the reasons to sell a stock?",
        "Is it a good idea to sell my stock at the current price?",
        "When does it make sense to sell a stock?",
        "Should I sell or hold onto my stock?",
        "What are the risks of holding onto a stock vs. selling it?",
        "How can I determine if I should sell my stock?",
        "Are there any red flags that suggest selling my stock?",
        "What are the circumstances where selling a stock is recommended?",
        "Should I sell my stock now or wait for a better opportunity?",
        "What should I analyze before deciding to sell a stock?",
        "When does selling a stock align with my investment goals?",
        "Is selling this stock the right move for my portfolio?",
        "Should I take profits and sell my stock?",
        "What are the potential downsides of selling my stock?",
        "Are there any external factors that indicate selling this stock?"
      ]
    }
  ]
}